/*
 * USART_HMI.C
 *
 */
#include "F28x_Project.h"
/*串口发送缓存*/

/***********************************************************
 * 函数名称：
 * 函数说明：串口发送函数
 * 输入参数：
 * 返回值：
 **********************************************************/
void USART_HMI_sendBufferData(uint8_t* buffer,uint16_t len)
{

}

/***********************************************************
 * 函数名称：
 * 函数说明：串口读取函数
 * 输入参数：*buffer  数据存放缓存
 * 返回值：   uint16_t 读取到的字节数量
 **********************************************************/
uint16_t USART_HMI_readBufferData(uint8_t *buffer)
{

}
/***********************************************************
 * 函数名称：
 * 函数说明：发送命令结束
 * 输入参数：
 * 返回值：
 **********************************************************/
void USART_HMI_sendCmdEnd()
{
    uint8_t cmdEndBuffer[3] = {0xFF,0xFF,0xFF};
    USART_HMI_sendBufferData(cmdEndBuffer,3);
}
/***********************************************************
 * 函数名称：
 * 函数说明：切换页
 * 输入参数：
 * 返回值：
 **********************************************************/
void USER_USART_HMI_setPage()
{

}
